CSI API ETABS v1

# cPropFrameSDShape Property

---

Gives access to API calls related to Section Designer sections.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropFrameSDShape SDShape { get; }

    ReadOnly Property SDShape As cPropFrameSDShape
    	Get

    Dim instance As cPropFrame
    Dim value As cPropFrameSDShape

    value = instance.SDShape

    property cPropFrameSDShape^ SDShape {
    	cPropFrameSDShape^ get ();
    }

    abstract SDShape : cPropFrameSDShape with get

#### Property Value

Type: cPropFrameSDShape

#### Return Value

Type: cPropFrameSDShape

Remarks

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com